In [1]:
import pandas as pd

In [3]:
data = pd.read_csv("survivor_employment_data.csv")

In [4]:
data.head()

,JOB_MATCH,S_NAME,S_AGE,S_GENDER,S_EDUCATION,S_UNDERSTANDING_COMM,S_GETTING_ALONG_PEOPLE,S_LIFE_ACT_HOUSE,S_LIFE_ACT_WORK,S_PARTICIPATE_SOCIETY,S_PREV_EMP,S_TOTAL_EXPERIENCE,JOB_DESCRIPTION,J_LANGUAGE,J_COMMUNICATION,J_PROB_SOLVE,J_ATTEN_VIGIL,J_ADAPT_INTERACT
0,N,Padama Harbhajan Mogul,47,Female,Primary School,4,1,1,3,3,2,6,Marketing,Y,Y,N,N,N
1,N,Anusha Toor,40,Female,Primary School,4,3,1,3,3,2,7,Marketing,Y,Y,N,N,N
2,N,Vineeta Sushant Butala,27,Female,Primary School,4,3,1,3,3,1,2,Marketing,Y,Y,N,N,N
3,N,Hema Radhakrishnan,26,Female,Primary School,4,3,1,3,3,1,2,Marketing,Y,Y,N,N,N
4,N,Nupoor Deep Biyani,48,Female,Primary School,3,3,1,3,2,1,6,Marketing,Y,Y,N,N,N

In [5]:
data['S_EDUCATION'].unique()

array(['Primary School', 'High School', 'Undergraduation',
       'Post Graduation'], dtype=object)

In [7]:
data.dtypes

JOB_MATCH                 object
S_NAME                    object
S_AGE                      int64
S_GENDER                  object
S_EDUCATION               object
S_UNDERSTANDING_COMM       int64
S_GETTING_ALONG_PEOPLE     int64
S_LIFE_ACT_HOUSE           int64
S_LIFE_ACT_WORK            int64
S_PARTICIPATE_SOCIETY      int64
S_PREV_EMP                 int64
S_TOTAL_EXPERIENCE         int64
JOB_DESCRIPTION           object
J_LANGUAGE                object
J_COMMUNICATION           object
J_PROB_SOLVE              object
J_ATTEN_VIGIL             object
J_ADAPT_INTERACT          object
dtype: object

In [8]:
data_obj = data.select_dtypes(include=['object']).copy()

In [9]:
data_obj.dtypes

JOB_MATCH           object
S_NAME              object
S_GENDER            object
S_EDUCATION         object
JOB_DESCRIPTION     object
J_LANGUAGE          object
J_COMMUNICATION     object
J_PROB_SOLVE        object
J_ATTEN_VIGIL       object
J_ADAPT_INTERACT    object
dtype: object

## Converting JOB_MATCH to a numeric 0/1 codes using Label Encoding

In [10]:
data_obj['JOB_MATCH'].value_counts()

N    1534
Y     494
Name: JOB_MATCH, dtype: int64

In [11]:
data_obj['JOB_MATCH'] = data_obj['JOB_MATCH'].astype('category')

In [12]:
data_obj['JOB_MATCH'].dtype

CategoricalDtype(categories=['N', 'Y'], ordered=False)

In [13]:
data_obj['JOB_MATCH_CAT'] = data_obj['JOB_MATCH'].cat.codes

In [20]:
data_obj[['JOB_MATCH', 'JOB_MATCH_CAT']].head()

  JOB_MATCH  JOB_MATCH_CAT
0         N              0
1         N              0
2         N              0
3         N              0
4         N              0

## Converting Education Level to Numeric Codes

In [22]:
data_obj['S_EDUCATION'].value_counts()

High School        882
Primary School     744
Undergraduation    354
Post Graduation     48
Name: S_EDUCATION, dtype: int64

In [23]:
# convert it to a category type
data_obj['S_EDUCATION'] = data_obj['S_EDUCATION'].astype('category')

In [24]:
data_obj['S_EDUCATION_CAT'] = data_obj['S_EDUCATION'].cat.codes

In [27]:
data_obj[['S_EDUCATION', 'S_EDUCATION_CAT']].head()

      S_EDUCATION  S_EDUCATION_CAT
0  Primary School                2
1  Primary School                2
2  Primary School                2
3  Primary School                2
4  Primary School                2